{
  "name": "HARRIS DAVID CHUKWUEBUKA",
  "headline": "Computer Science Graduate • Technology Enthusiast • Cyber Security Master's Student",
  "location": "Newport - Gwent, NP19 4AN United Kingdom",
  "phone": "+44 7502 246881",
  "email": "davidharris200111@gmail.com",
  "website": "https://github.com/kingdavid200",
  "summary": "I am a driven and enthusiastic Computer Science graduate looking for an opportunity to contribute my expertise in software development, IT services, and analytical thinking. I have a genuine passion for technology and a strong desire to gain real-world experience in a dynamic work setting. Known for being a reliable team player with solid leadership abilities, adaptability, and a forward‑thinking mindset. I bring hands‑on experience in delivering quality technical support and effectively troubleshooting to maintain smooth IT operations. Resourceful in identifying and resolving both hardware and software problems efficiently. I am skilled in clear communication, especially when translating technical ideas into user‑friendly explanations.",
  "experience": [
    {
      "title": "Data Analyst",
      "company": "Digital Echoes",
      "location": "London, UK",
      "startDate": "June 2025",
      "endDate": "Present",
      "details": [
        "Analyzed datasets from Google Analytics and Excel to identify trends in sessions, users, and acquisition channels.",
        "Created reusable Power BI templates and Excel visuals for consistent reporting and dashboard updates.",
        "Assisted in data formatting, testing, and integration across tools to ensure clean transitions and clear outputs.",
        "Managed data access and supported peers in troubleshooting data display and metric calculation issues.",
        "Reviewed performance metrics and built tracking for KPIs like session growth and country distribution.",
        "Produced structured reports that guided insights on resource placement and performance trends."
      ]
    },
    {
      "title": "IT Technical Analyst",
      "company": "Adventus IT Services (Philippines) Inc.",
      "location": "Makati, Metro Manila, Philippines",
      "startDate": "June 2024",
      "endDate": "December 2025",
      "details": [
        "Provided first‑level technical support and resolved hardware, software, and network‑related issues to minimize system downtime.",
        "Conducted system diagnostics and assisted in implementing solutions aligned with organizational IT standards.",
        "Collaborated with software developers to test applications, document bugs, and verify feature enhancements.",
        "Analyzed user requirements and contributed to system upgrades and process improvements.",
        "Created and maintained technical documentation, including system specifications and configuration guides.",
        "Participated in IT projects by gathering data, supporting deployments, and conducting post‑implementation reviews.",
        "Assisted with the configuration and management of mobile and remote‑access solutions to support a hybrid workforce.",
        "Supported IT asset management through inventory tracking and usage reporting."
      ]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science in Computer Science",
      "school": "Arellano University",
      "location": "Legarda, Philippines",
      "year": "2025",
      "details": "Dissertation in Software Development"
    },
    {
      "degree": "Senior High School",
      "school": "Kings Senior High School",
      "location": "Nigeria",
      "year": "2017",
      "details": ""
    },
    {
      "degree": "Junior High School",
      "school": "Kings Junior High School",
      "location": "Nigeria",
      "year": "2014",
      "details": ""
    },
    {
      "degree": "Primary Education",
      "school": "Kings Elementary School",
      "location": "Nigeria",
      "year": "2011",
      "details": ""
    }
  ],
  "skills": [
    {"name": "Java", "level": 85},
    {"name": "C, C++, C#", "level": 80},
    {"name": "Python", "level": 75},
    {"name": "Web Development (HTML, CSS, JavaScript)", "level": 90},
    {"name": "Data Analysis", "level": 80},
    {"name": "MySQL", "level": 70},
    {"name": "IT Troubleshooting", "level": 85},
    {"name": "Leadership & Teamwork", "level": 80},
    {"name": "Critical Thinking", "level": 85},
    {"name": "MS Office", "level": 90}
  ],
  "certifications": [
    {
      "title": "Certified in CC Domain 1: Security Principles",
      "issuer": "(ISC)²",
      "validity": "Jan 10 2025 – Jan 10 2028"
    },
    {
      "title": "Certified in CC Domain 2: Incident Response, Business Continuity, and Disaster Recovery Concepts",
      "issuer": "(ISC)²",
      "validity": "Jan 11 2025 – Jan 11 2028"
    },
    {
      "title": "Certified in CC Domain 3: Access Control Concepts",
      "issuer": "(ISC)²",
      "validity": "Jan 11 2025 – Jan 11 2028"
    },
    {
      "title": "Certified in CC Domain 4: Network Security",
      "issuer": "(ISC)²",
      "validity": "Jan 12 2025 – Jan 12 2028"
    }
  ],
  "training": [
    {
      "title": "Data Analyst – Advance Careers UK",
      "date": "April 2025",
      "topics": [
        "Data preprocessing",
        "Descriptive statistics",
        "Regression analysis",
        "Data visualization using charts and PivotTables",
        "Excel functions like SUMIF, filtering, and conditional formatting",
        "Introduction to machine learning techniques",
        "Real‑world applications in pharmaceutical and business data"
      ],
      "projects": [
        "Sales performance analysis using Excel",
        "Predictive modeling using linear regression on pharmaceutical data",
        "Dashboard creation for summarizing large datasets"
      ]
    }
  ],
  "workshops": [
    {"title": "Techtutor 2021: The New Digital Life", "date": "2021‑10‑16"},
    {"title": "Techtutor 2021: The New Digital Life", "date": "2021‑10‑23"},
    {"title": "How to Level Up: Mastering Tech Skills for Future Innovators", "date": "2024‑01‑12"},
    {"title": "Innovating with Intelligence: AI Ethics and Big Data Transparency", "date": "2024‑03‑20"}
  ],
  "projects": [
  {
    "title": "Cybersecurity Home Lab",
    "description": "Built and maintained a dedicated home lab environment to apply cybersecurity, networking, and systems administration skills. Managed multiple networked devices and services to replicate professional IT workflows, troubleshoot issues, and test secure configurations.",
    "technologies": ["Networking", "Cybersecurity", "Virtualization"]
  },
  {
    "title": "Windows Server & Active Directory Setup",
    "description": "Deployed and configured Windows Server for production-style use, implementing Active Directory, creating and managing user accounts, applying group policies, setting up DNS, and verifying network services. Configured virtual machines with static IP addressing and DNS settings to maintain stable and secure domain connectivity.",
    "technologies": ["Windows Server", "Active Directory", "DNS"]
  },
  {
    "title": "Smart Destination Alert System",
    "description": "Designed and developed a mobile-based application that integrates GPS, real-time alerts, offline mode, and fare calculation features. Alerts commuters when approaching their designated stop and includes a route map, fare checker, and nearby station finder for enhanced travel convenience.",
    "technologies": ["Android", "Java", "GPS", "SQLite"]
  },
  {
    "title": "Ticket Management System",
    "description": "Built an internal IT helpdesk platform for managing and tracking support tickets. Incorporated features for prioritizing requests, logging resolution times, and maintaining a history of service records for organizational efficiency.",
    "technologies": ["Java", "Spring Boot", "MySQL"]
  },
  {
    "title": "Document Tracking System",
    "description": "Created a database-driven application with secure login, user roles, and timestamp tracking to monitor document movement and status within an organization. Designed to improve accountability and streamline workflow.",
    "technologies": ["PHP", "MySQL", "JavaScript"]
  },
  {
    "title": "File Management System",
    "description": "Developed a desktop application in NetBeans with MySQL database integration, supporting multiple user logins with role-based access. Included an admin panel for managing files, organizing storage, and retrieving documents efficiently.",
    "technologies": ["Java", "MySQL", "NetBeans"]
  },
  {
    "title": "HTML, PHP, and Database-Based Projects",
    "description": "Developed dynamic portfolio websites and Windows applications with admin dashboards and database integration. One notable project was an equipment tracking application with real-time inventory management, user authentication, and role-based access control.",
    "technologies": ["HTML", "PHP", "CSS", "JavaScript", "MySQL"]
  },
  {
    "title": "Arduino Line Tracking Robot Car",
    "description": "Engineered a fully functional robot car from scratch using an Arduino board. Integrated sensors for line tracking, obstacle avoidance, and the ability to follow predefined paths or reprogrammed routes.",
    "technologies": ["Arduino", "C++", "Sensors"]
  },
  {
    "title": "PC Build",
    "description": "Assembled a high-performance desktop (Rig 1) optimized for gaming, software development, and data analysis. Specifications: ASUS Prime Z270-A motherboard, Intel Core i7-7700, 32GB DDR4 RAM, NVIDIA GTX 1650 GPU, dual SSDs, and NVMe storage.",
    "technologies": ["Hardware Assembly", "PC Building", "Troubleshooting"]
  }
],
  "careerGoals": [
    "Gain hands‑on experience in software, mobile, and web development while enhancing problem‑solving and analytical skills.",
    "Develop expertise in AI, machine learning, and emerging technologies to contribute to innovative tech solutions."
  ],
  "socials": [
    {
      "platform": "GitHub",
      "url": "https://github.com/kingdavid200",
      "icon": "🐱"
    },
    {
      "platform": "LinkedIn",
      "url": "https://www.linkedin.com/in/david-harris",
      "icon": "💼"
    },
    {
      "platform": "Twitter",
      "url": "https://twitter.com/kingdavid200",
      "icon": "🐦"
    }
  ]
}
